SeeedJP/seeed-wio-terminal-mbed6/rtl8720dn-driver/RTL8720DNInterface.cpp
/* RTL8720DN implementation of NetworkInterfaceAPI
 * Copyright (c) 2015 ARM Limited
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#if DEVICE_SPI && DEVICE_INTERRUPTIN && defined(MBED_CONF_EVENTS_PRESENT) && defined(MBED_CONF_NSAPI_PRESENT) && defined(MBED_CONF_RTOS_API_PRESENT)

#include <string.h>
#include <stdint.h>

#include "RTL8720DN.h"
#include "RTL8720DNInterface.h"
#include "events/EventQueue.h"
#include "events/mbed_shared_queues.h"
#include "features/netsocket/nsapi_types.h"
#include "mbed_trace.h"
#include "platform/Callback.h"
#include "platform/mbed_atomic.h"
#include "platform/mbed_debug.h"
#include "rtos/ThisThread.h"

using namespace std::chrono;

#ifndef MBED_CONF_RTL8720DN_DEBUG
#define MBED_CONF_RTL8720DN_DEBUG false
#endif

#ifndef MBED_CONF_RTL8720DN_RTS
#define MBED_CONF_RTL8720DN_RTS NC
#endif

#ifndef MBED_CONF_RTL8720DN_CTS
#define MBED_CONF_RTL8720DN_CTS NC
#endif

#ifndef MBED_CONF_RTL8720DN_RST
#define MBED_CONF_RTL8720DN_RST NC
#endif

#ifndef MBED_CONF_RTL8720DN_PWR
#define MBED_CONF_RTL8720DN_PWR NC
#endif

#define TRACE_GROUP  "ESPI" // RTL8720DN Interface

#define RTL8720DN_WIFI_IF_NAME "es0"

#define LOCAL_ADDR "127.0.0.1"

using namespace mbed;
using namespace rtos;

// RTL8720DNInterface implementation
RTL8720DNInterface::RTL8720DNInterface(PinName mosi, PinName miso, PinName sclk, PinName cs, PinName sync, PinName enable, bool debug, PinName rst, PinName pwr)
    : _rtl(mosi, miso, sclk, cs, sync, enable, debug),
      _rst_pin(rst),
      _pwr_pin(pwr),
      _ap_sec(NSAPI_SECURITY_UNKNOWN),
      _if_blocking(true),
#if MBED_CONF_RTOS_PRESENT
      _if_connected(_cmutex),
#endif
      _initialized(false),
      _connect_retval(NSAPI_ERROR_OK),
      _disconnect_retval(NSAPI_ERROR_OK),
      _conn_stat(NSAPI_STATUS_DISCONNECTED),
      _conn_stat_cb(),
      _global_event_queue(mbed_event_queue()), // Needs to be set before attaching event() to SIGIO
      _oob_event_id(0),
      _connect_event_id(0),
      _disconnect_event_id(0),
      _software_conn_stat(IFACE_STATUS_DISCONNECTED),
      _dhcp(true)
{
    memset(_cbs, 0, sizeof(_cbs));
    memset(ap_ssid, 0, sizeof(ap_ssid));
    memset(ap_pass, 0, sizeof(ap_pass));

    _ch_info.track_ap = true;
    strncpy(_ch_info.country_code, MBED_CONF_RTL8720DN_COUNTRY_CODE, sizeof(_ch_info.country_code));
    _ch_info.channel_start = MBED_CONF_RTL8720DN_CHANNEL_START;
    _ch_info.channels = MBED_CONF_RTL8720DN_CHANNELS;

    //_rtl.sigio(this, &RTL8720DNInterface::event);
    _rtl.set_timeout();
    _rtl.attach(this, &RTL8720DNInterface::refresh_conn_state_cb);

    for (int i = 0; i < RTL8720DN_SOCKET_COUNT; i++) {
        _sock_i[i].open = false;
        _sock_i[i].sport = 0;
    }
}

RTL8720DNInterface::~RTL8720DNInterface()
{
    if (_oob_event_id) {
        _global_event_queue->cancel(_oob_event_id);
    }

    _cmutex.lock();
    if (_connect_event_id) {
        _global_event_queue->cancel(_connect_event_id);
    }
    _cmutex.unlock();

    // Power down the modem
    _rst_pin.rst_assert();
    // Power off the modem
    _pwr_pin.power_off();
}

RTL8720DNInterface::ResetPin::ResetPin(PinName rst_pin) : _rst_pin(mbed::DigitalOut(rst_pin, 1))
{
}

void RTL8720DNInterface::ResetPin::rst_assert()
{
    if (_rst_pin.is_connected()) {
        _rst_pin = 0;
        tr_debug("rst_assert(): HW reset asserted.");
    }
}

void RTL8720DNInterface::ResetPin::rst_deassert()
{
    if (_rst_pin.is_connected()) {
        // Notice that Pin7 CH_EN cannot be left floating if used as reset
        _rst_pin = 1;
        tr_debug("rst_deassert(): HW reset deasserted.");
    }
}

bool RTL8720DNInterface::ResetPin::is_connected()
{
    return _rst_pin.is_connected();
}

RTL8720DNInterface::PowerPin::PowerPin(PinName pwr_pin) : _pwr_pin(mbed::DigitalOut(pwr_pin, !MBED_CONF_RTL8720DN_POWER_ON_POLARITY))
{
}

void RTL8720DNInterface::PowerPin::power_on()
{
    if (_pwr_pin.is_connected()) {
        _pwr_pin = MBED_CONF_RTL8720DN_POWER_ON_POLARITY;
        tr_debug("power_on(): HW power-on.");
        ThisThread::sleep_for(milliseconds(MBED_CONF_RTL8720DN_POWER_ON_TIME_MS));
    }
}

void RTL8720DNInterface::PowerPin::power_off()
{
    if (_pwr_pin.is_connected()) {
        _pwr_pin = !MBED_CONF_RTL8720DN_POWER_ON_POLARITY;
        tr_debug("power_off(): HW power-off.");
        ThisThread::sleep_for(milliseconds(MBED_CONF_RTL8720DN_POWER_OFF_TIME_MS));
    }
}

void RTL8720DNInterface::_power_off()
{
    _rst_pin.rst_assert();
    _pwr_pin.power_off();
}

bool RTL8720DNInterface::PowerPin::is_connected()
{
    return _pwr_pin.is_connected();
}

int RTL8720DNInterface::connect(const char *ssid, const char *pass, nsapi_security_t security,
                              uint8_t channel)
{
    if (channel != 0) {
        return NSAPI_ERROR_UNSUPPORTED;
    }

    int err = set_credentials(ssid, pass, security);
    if (err) {
        return err;
    }

    return connect();
}

void RTL8720DNInterface::_connect_async()
{
    nsapi_error_t status = _init();
    if (status != NSAPI_ERROR_OK) {
        _connect_retval = status;
        _software_conn_stat = IFACE_STATUS_DISCONNECTED;
        //_conn_stat_cb will be called from refresh_conn_state_cb
        return;
    }

    if (_dhcp && !_rtl.dhcp(true, 1)) {
        _connect_retval = NSAPI_ERROR_DHCP_FAILURE;
        _software_conn_stat = IFACE_STATUS_DISCONNECTED;
        //_conn_stat_cb will be called from refresh_conn_state_cb
        return;
    }
    _cmutex.lock();
    if (!_connect_event_id) {
        tr_debug("_connect_async(): Cancelled.");
        _cmutex.unlock();
        return;
    }
    _connect_retval = _rtl.connect(ap_ssid, ap_pass);
    auto timepassed = _conn_timer.elapsed_time();
    if (_connect_retval == NSAPI_ERROR_OK
            || _connect_retval == NSAPI_ERROR_AUTH_FAILURE
            || _connect_retval == NSAPI_ERROR_NO_SSID
            || ((_if_blocking == true) && (timepassed >= RTL8720DN_INTERFACE_CONNECT_TIMEOUT))) {
        _connect_event_id = 0;
        _conn_timer.stop();
        if (timepassed >= RTL8720DN_INTERFACE_CONNECT_TIMEOUT && _connect_retval != NSAPI_ERROR_OK) {
            _connect_retval = NSAPI_ERROR_CONNECTION_TIMEOUT;
        }
        if (_connect_retval != NSAPI_ERROR_OK) {
            _software_conn_stat = IFACE_STATUS_DISCONNECTED;
        }
#if MBED_CONF_RTOS_PRESENT
        _if_connected.notify_all();
#endif
    } else {
        // Postpone to give other stuff time to run
        _connect_event_id = _global_event_queue->call_in(RTL8720DN_INTERFACE_CONNECT_INTERVAL,
                                                         callback(this, &RTL8720DNInterface::_connect_async));
        if (!_connect_event_id) {
            MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER, MBED_ERROR_CODE_ENOMEM), \
                       "RTL8720DNInterface::_connect_async(): unable to add event to queue. Increase \"events.shared-eventsize\"\n");
        }
    }
    _cmutex.unlock();

    if (_connect_event_id == 0) {
        if (_conn_stat_cb) {
            _conn_stat_cb(NSAPI_EVENT_CONNECTION_STATUS_CHANGE, _conn_stat);
        }
        if (_conn_stat == NSAPI_STATUS_GLOBAL_UP || _conn_stat == NSAPI_STATUS_LOCAL_UP) {
            _software_conn_stat = IFACE_STATUS_CONNECTED;
        }
    }
}

