SeeedJP/seeed-wio-terminal-mbed6/rtl8720dn-driver/RTL8720DNInterface.cpp
    if (!_disconnect_event_id) {
        MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER, MBED_ERROR_CODE_ENOMEM),
                   "disconnect(): unable to add event to queue. Increase \"events.shared-eventsize\"\n");
    }

#if MBED_CONF_RTOS_PRESENT
    while (_if_blocking
            && (_conn_status_to_error() != NSAPI_ERROR_NO_CONNECTION)
            && (_disconnect_retval != NSAPI_ERROR_OK)) {
        _if_connected.wait();
    }
#endif

    _cmutex.unlock();
    if (!_if_blocking) {
        return NSAPI_ERROR_OK;
    } else {
        return _disconnect_retval;
    }
}

nsapi_error_t RTL8720DNInterface::get_ip_address(SocketAddress *address)
{
    const char *ip_buff = _rtl.ip_addr();
    if (!ip_buff || strcmp(ip_buff, "0.0.0.0") == 0) {
        ip_buff = NULL;
    }

    if (ip_buff) {
        address->set_ip_address(ip_buff);
        return NSAPI_ERROR_OK;
    }
    return NSAPI_ERROR_NO_ADDRESS;
}

const char *RTL8720DNInterface::get_mac_address()
{
    const char *ret = _rtl.mac_addr();

    return ret;
}

nsapi_error_t RTL8720DNInterface::get_gateway(SocketAddress *address)
{
    if (address == nullptr) {
        return NSAPI_ERROR_PARAMETER;
    }
    if (_conn_stat == NSAPI_STATUS_DISCONNECTED) {
        return NSAPI_ERROR_NO_CONNECTION;
    }

    if (!address->set_ip_address(_rtl.gateway())) {
        return NSAPI_ERROR_NO_ADDRESS;
    }

    return NSAPI_ERROR_OK;
}

const char *RTL8720DNInterface::get_gateway()
{
    return _conn_stat != NSAPI_STATUS_DISCONNECTED ? _rtl.gateway() : NULL;
}

nsapi_error_t RTL8720DNInterface::get_netmask(SocketAddress *address)
{
    if (address == nullptr) {
        return NSAPI_ERROR_PARAMETER;
    }
    if (_conn_stat == NSAPI_STATUS_DISCONNECTED) {
        return NSAPI_ERROR_NO_CONNECTION;
    }

    if (!address->set_ip_address(_rtl.netmask())) {
        return NSAPI_ERROR_NO_ADDRESS;
    }

    return NSAPI_ERROR_OK;
}

const char *RTL8720DNInterface::get_netmask()
{
    return _conn_stat != NSAPI_STATUS_DISCONNECTED ? _rtl.netmask() : NULL;
}

nsapi_error_t RTL8720DNInterface::get_time(std::tm *t)
{
    _init();
    return _rtl.get_sntp_time(t) ? NSAPI_ERROR_OK : NSAPI_ERROR_TIMEOUT;
}

char *RTL8720DNInterface::get_interface_name(char *interface_name)
{
    memcpy(interface_name, RTL8720DN_WIFI_IF_NAME, sizeof(RTL8720DN_WIFI_IF_NAME));
    return interface_name;
}

int8_t RTL8720DNInterface::get_rssi()
{
    int8_t ret = _rtl.rssi();

    return ret;
}

int RTL8720DNInterface::scan(WiFiAccessPoint *res, unsigned count)
{
    return scan(res, count, SCANMODE_ACTIVE);
}

int RTL8720DNInterface::scan(WiFiAccessPoint *res, unsigned count, scan_mode mode, mbed::chrono::milliseconds_u32 t_max, mbed::chrono::milliseconds_u32 t_min)
{
    if (t_max > RTL8720DN_SCAN_TIME_MAX) {
        return NSAPI_ERROR_PARAMETER;
    }
    if (mode == SCANMODE_ACTIVE && t_min > t_max) {
        return NSAPI_ERROR_PARAMETER;
    }

    nsapi_error_t status = _init();
    if (status != NSAPI_ERROR_OK) {
        return status;
    }

    int ret = _rtl.scan(res, count, (mode == SCANMODE_ACTIVE ? RTL8720DN::SCANMODE_ACTIVE : RTL8720DN::SCANMODE_PASSIVE),
                        t_max, t_min);

    return ret;
}

#if MBED_CONF_RTL8720DN_BUILT_IN_DNS
nsapi_error_t RTL8720DNInterface::gethostbyname(const char *name, SocketAddress *address, nsapi_version_t version, const char *interface_name)
{
    char ip[NSAPI_IPv4_SIZE];
    memset(ip, 0, NSAPI_IPv4_SIZE);
    if (!_rtl.dns_lookup(name, ip)) {
        return NSAPI_ERROR_DNS_FAILURE;
    }
    if (!address->set_ip_address(ip)) {
        return NSAPI_ERROR_DNS_FAILURE;
    }

    return NSAPI_ERROR_OK;
}


nsapi_error_t RTL8720DNInterface::add_dns_server(const SocketAddress &address, const char *interface_name)
{
    return NSAPI_ERROR_OK;
}
#endif

bool RTL8720DNInterface::_get_firmware_ok()
{
    RTL8720DN::fw_at_version at_v = _rtl.at_version();
    if (at_v.major < RTL8720DN_AT_VERSION_MAJOR) {
        debug("RTL8720DN: ERROR: AT Firmware v%d incompatible with this driver.", at_v.major);
        debug("Update at least to v%d - https://developer.mbed.org/teams/RTL8720DN/wiki/Firmware-Update\n", RTL8720DN_AT_VERSION_MAJOR);
        MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER, MBED_ERROR_UNSUPPORTED), "Too old AT firmware");
    }
    RTL8720DN::fw_sdk_version sdk_v = _rtl.sdk_version();
    if (sdk_v.major < RTL8720DN_SDK_VERSION_MAJOR) {
        debug("RTL8720DN: ERROR: Firmware v%d incompatible with this driver.", sdk_v.major);
        debug("Update at least to v%d - https://developer.mbed.org/teams/RTL8720DN/wiki/Firmware-Update\n", RTL8720DN_SDK_VERSION_MAJOR);
        MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER, MBED_ERROR_UNSUPPORTED), "Too old SDK firmware");
    }

    return true;
}

nsapi_error_t RTL8720DNInterface::_init(void)
{
    if (!_initialized) {
        _pwr_pin.power_off();
        _pwr_pin.power_on();

        if (_reset() != NSAPI_ERROR_OK) {
            return NSAPI_ERROR_DEVICE_ERROR;
        }
        if (!_rtl.echo_off()) {
            return NSAPI_ERROR_DEVICE_ERROR;
        }
        if (!_get_firmware_ok()) {
            return NSAPI_ERROR_DEVICE_ERROR;
        }
        if (!_rtl.set_default_wifi_mode(RTL8720DN::WIFIMODE_STATION)) {
            return NSAPI_ERROR_DEVICE_ERROR;
        }
        if (!_rtl.set_country_code_policy(true, _ch_info.country_code, _ch_info.channel_start, _ch_info.channels)) {
            return NSAPI_ERROR_DEVICE_ERROR;
        }
        if (!_rtl.cond_enable_tcp_passive_mode()) {
            return NSAPI_ERROR_DEVICE_ERROR;
        }
        if (!_rtl.startup(RTL8720DN::WIFIMODE_STATION)) {
            return NSAPI_ERROR_DEVICE_ERROR;
        }
#if MBED_CONF_RTL8720DN_SNTP_ENABLE
        if (!_rtl.set_sntp_config(MBED_CONF_RTL8720DN_SNTP_ENABLE,
                                  MBED_CONF_RTL8720DN_SNTP_TIMEZONE,
                                  MBED_CONF_RTL8720DN_SNTP_SERVER0,
                                  MBED_CONF_RTL8720DN_SNTP_SERVER1,
                                  MBED_CONF_RTL8720DN_SNTP_SERVER2)) {
            return NSAPI_ERROR_DEVICE_ERROR;
        }
#endif
        _initialized = true;
    }
    return NSAPI_ERROR_OK;
}

nsapi_error_t RTL8720DNInterface::_reset()
{
    if (_rst_pin.is_connected()) {
        _rst_pin.rst_assert();
        // If you happen to use Pin7 CH_EN as reset pin, not needed otherwise
        // https://www.espressif.com/sites/default/files/documentation/esp8266_hardware_design_guidelines_en.pdf
        // First need to round up when converting to kernel ticks (eg 200us -> 1ms).
        auto delay = duration_cast<Kernel::Clock::duration_u32>(200us);
        if (delay < 200us) {
            delay++;
        }
        // Then need to round the clock-resolution duration up; if we were at the end of a tick
        // period, it might flip immediately.
        delay++;
        ThisThread::sleep_for(delay);
        _rtl.flush();
        _rst_pin.rst_deassert();
    } else {
        _rtl.flush();
        if (!_rtl.at_available()) {
            return NSAPI_ERROR_DEVICE_ERROR;
        }
        if (!_rtl.reset()) {
            return NSAPI_ERROR_DEVICE_ERROR;
        }
    }

